<?php if ( ! defined('BASEPATH')) exit('No direct script access allowed');

	//ステータス
	$config["status"] = array( 0 => "有効", 1 => "無効" );

	//イベント開催日程
	$config["venue"] = array( 0 => "開催予定", 1 => "開催決定", 2 => "ペンディング", 9 => "キャンセル" );

	//イベント種別
	$config["type"] = array( 0 => "説明会", 1 => "インターン", 2 => "内定者向け", 9 => "その他" );

	//ターゲット選考段階比較タイプ・求人選考段階数目標
	$config["screening_stage_type"] = array( 0 => "以前", 1 => "以降", 2 => "限定" );

	//イベント参加履歴（参加後評価スコア）
	$config["after_score"] = array( 0 => "何としてでも採用したい", 1 => "志願してくれれば採用してもいい", 2 => "将来に期待", 9 => "採用したくない" );

	//イベント参加履歴（ステータス）
	$config["ev_status"] = array( 0 => "予約中", 1 => "申込済", 2 => "候補者キャンセル連絡有", 3 => "主催者キャンセル", 4 => "参加済", 5 => "無断欠席" );

	//提出書類（ステータス）
	$config["doc_status"] = array( 0 => "有効", 1 => "削除" );

	//採用担当者タイプ
	$config["focal_point_type"] = array( 0 => "人事", 1 => "面接官" );

	//職種タイプ
	$config["job_status"] = array( 1 => "ペンディング", 0 => "確定", 9 => "キャンセル" );

	//選考履歴／イベント／求人選考段階数目標（選考ステータス・ターゲット選考ステータス）
	$config["select_judgment_type"] = array( 0 => "受付済／スケジュール調整中", 1 => "候補者スケジュール確認済", 2 => "採用担当者スケジュール確認済",
								 3 => "スケジュールFix", 4 => "面接済/評価待ち" , 5 => "合格", 6 => "不合格", 7 => "内定辞退", 8 => "求人都合キャンセル", 9 => "候補者都合キャンセル", 10 => "ペンディング");

	//選考履歴（選考ステータスオプション）
	$config["select_option"] = array( 0 => "他社のほうが優先順位が高いため", 1 => "会社や求人に興味が失せたため", 2 => "業種に興味が失せた為", 9 => "その他" );

	//ステータス（選考履歴・候補者・採用担当者選考履歴・語学・特記事項・候補者カスタム属性
	$config["sel_status"] = array( 0 => "有効", 1 => "削除" );

	//最終更新者タイプ（選考履歴・候補者）
	$config["last_modified_type"] = array( 0 => "流入元", 1 => "候補者", 2 => "採用担当者" );

	//候補者（性別）
	$config["sex"] = array( 0 => "男", 1 => "女", 2 => "不明" );

	//求人票公開先流入元企業
	$config["job_vote_status"] = array( 0 => "割当", 1 => "非公開" );

	//採用担当者選考履歴（アサイン状況）
	$config["assign_situation"] = array( 0 => "調整中", 1 => "スケジュール確定選考待ち", 9 => "キャンセル", 2 => "評価済" );

	//採用担当者選考履歴（評価ランク）
	$config["evaluation_rank"] = array( 0 => "保留", 1 => "合格", 9 => "不合格" );

	//語学（外国語）
	$config["add_foreign_language"] = array( 0 => "英語", 2 => "中国語", 3 => "韓国語" , 4 => "フランス語", 5 => "ドイツ語", 9 => "それ以外" );

	//語学（レベル）
	$config["add_level"] = array( 0 => "日常会話", 1 => "ビジネスレベル", 2 => "ネイティブ" );

	//特記事項（登録者タイプ）
	$config["register_type"] = array( 0 => "採用担当者", 1 => "流入元" );

	//カスタム項目（タイプ）
	$config["custom_type"] = array( 0 => "文字", 1 => "数値" );

	//流入元タイプ
	$config["influx_original_type"] = array( 0 => "ナビ", 1 => "紹介", 2 => "その他" );

	//流入元企業マスタ(ステータス)
	$config["referer_status"] = array( 0 => "有効", 1 => "契約終了", 9 => "無効" );

	//流入元契約（契約タイプ）
	$config["contract_type"] = array( 0 => "固定", 1 => "無制限（年間固定）", 9 => "年収割合" );

	//流入元契約（契約ステータス）
	$config["inf_status"] = array( 0 => "有効期限", 1 => "期限切れ", 2 => "自動更新", 9 => "無効" );

	//学歴（文理区分）
	$config["bunri_class"] = array( 0 => "文系", 1 => "理系", 2 => "芸術系", 9 => "その他" );

	//国公私立区分（学校区分）
	$config["school_class"] = array( 0 => "大学院", 1 => "大学", 2 => "高専", 3 => "短期大学", 4=> "専門大学", 5 => "高校", 9 => "その他" );

	//国公私立区分（国公私立区分）
	$config["public_private_class"] = array( 0 => "国立", 1 => "公立", 2 => "私立", 9 => "その他" );

	//国公私立区分（学校ランク）
	$config["school_rank"] = array( 0 => "A", 1 => "B", 2 => "C", 3 => "D", 4 => "E", 9 => "指定無" );

	//ユーザー企業（市場）
	$config["market"] = array( 1 => "東証一部", 2 => "東証二部", 3 => "マザーズ", 4 => "JASDAQ", 5 => "名証一部", 6 => "名証二部",
								7 => "セントレックス", 8 => "札幌市場", 9 => "アンビシャス", 10 => "福岡市場", 11 => "Q-Board", 99 => "その他" );

	//ユーザー企業（業種）
	$config["business"] = array( 1 => "水産・農林業", 2 => "鉱業", 3 => "建設業", 4 => "製造業", 5 => "電気・ガス業", 6 => "指定運輸・情報通信業",
								7 => "商業", 8 => "金融・保険業", 9 => "不動産業", 10 => "サービス業" );

	//求人票（職種タイプ）
	$config["job_type"] = array( 1 => "事務・管理系", 2 => "企画系", 3 => "営業系", 4 => "技術・研究系", 5 => "販売・サービス系", 6 => "専門系",
									 7 => "医療・福祉系", 8 => "金融系", 9 => "クリエイティブ系", 10 => "IT系", 99 => "その他" );